Trying to reproduce the sceanrio via:

```terraform
resource "cloudfoundry_space" "space" {
  name      = "test-space"
  org       = "<some org id>"
  allow_ssh = "false"
}

data "cloudfoundry_space" "space" {
  name       = cloudfoundry_space.space.name
  org        = "cc78b985-3061-4fc1-8e6d-7f6f4b50244e"
  depends_on = [cloudfoundry_space.space]
}

data "cloudfoundry_service_plan" "auditlog_management" {
  name                  = "default"
  service_offering_name = "auditlog-management"
  depends_on            = [data.cloudfoundry_space.space]
}


resource "cloudfoundry_service_instance" "auditlog_management_svc" {
  name         = "auditlog-management-instance"
  type         = "managed"
  space        = data.cloudfoundry_space.space.id
  service_plan = data.cloudfoundry_service_plan.auditlog_management.id
}
```

This basically mimics your setup via modules. 
I also addded the plan modifier `stringplanmodifier.UseStateForUnknown(),` to the `space` attribute of the resource `resource_service_instance.go` according to the initial issue mentioned in this PR.

After the initial creation, I changed the `allow_ssh` attribute to `true` which results in:

This does not change the behavior, a replace will take place:

```bash
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.cloudfoundry_space.space will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_space" "space" {
      + allow_ssh         = (known after apply)
      + annotations       = (known after apply)
      + created_at        = (known after apply)
      + id                = (known after apply)
      + isolation_segment = (known after apply)
      + labels            = (known after apply)
      + name              = "test-space"
      + org               = "<my-org-id>"
      + quota             = (known after apply)
      + updated_at        = (known after apply)
    }

  # cloudfoundry_service_instance.auditlog_management_svc must be replaced
-/+ resource "cloudfoundry_service_instance" "auditlog_management_svc" {
      ~ created_at        = "2026-02-23T10:50:25Z" -> (known after apply)
      + dashboard_url     = (known after apply)
      ~ id                = "b5666e1a-0cd5-4943-a389-eeb22b7a12b0" -> (known after apply)
      ~ last_operation    = {
          ~ created_at  = "2026-02-23T10:50:25Z" -> (known after apply)
          + description = (known after apply)
          ~ state       = "succeeded" -> (known after apply)
          ~ type        = "create" -> (known after apply)
          ~ updated_at  = "2026-02-23T10:50:25Z" -> (known after apply)
        } -> (known after apply)
      ~ maintenance_info  = {
          + description = (known after apply)
          + version     = (known after apply)
        } -> (known after apply)
        name              = "auditlog-management-instance"
      ~ space             = "4ab5b91b-57ba-46d8-85ff-09a2d6e94fe0" -> (known after apply) # forces replacement
      ~ updated_at        = "2026-02-23T10:50:25Z" -> (known after apply)
      ~ upgrade_available = false -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # cloudfoundry_space.space will be updated in-place
  ~ resource "cloudfoundry_space" "space" {
      ~ allow_ssh  = false -> true
        id         = "4ab5b91b-57ba-46d8-85ff-09a2d6e94fe0"
        name       = "test-space"
      ~ updated_at = "2026-02-23T10:47:37Z" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
``` 

The reason is that the planmodifer is not intended to handle situations like this. It can be used when *an unconfigured value will remain the same after a resource update*. In this sceanrio the attribute `space` is a required attribute and part of the configuration of the service instance resource. The plan modifier will therefore not copy over any values during plan phase:

<img width="1429" height="468" alt="Bildschirmfoto 2026-02-23 um 12 08 39" src="https://github.com/user-attachments/assets/1fc8936e-dda6-4ca7-bd38-55bffe640d62" />

I wonder why this would work on your end with the code you provided. 
